AL-255/gbjit-xtensa/boards/HTIT-WB32LAF_V3.2/sdkconfig.defaults
# HTIT-WB32LAF_V3.2 — ESP32-S3 dev board with onboard I2C SSD1306 OLED.
# Pin map (see main/board.h): OLED_SDA=GPIO17, OLED_SCL=GPIO18, OLED_RST=GPIO20.

CONFIG_IDF_TARGET="esp32s3"

# Console on UART0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Release build.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Keep memprot off — the JIT codecache lives in static IRAM, writes via
# the data path, and would trip memprot if it were on.
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n

# Disable both watchdogs — the dispatcher's busy-loop does no yields.
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Run the core at its rated max (240 MHz). The ESP32-S3 datasheet
# specifies 240 MHz as the maximum supported clock; ESP-IDF only
# exposes 80/160/240 (the three PLL output paths). Pushing past 240 on
# this part requires register-poking the PLL chain which is unsupported
# and unstable across units / temperatures — we keep to the datasheet.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Note: QIO/120 MHz flash both tripped an IDF v6.0.1 compile bug in
# components/spi_flash/spi_flash_hpm_enable.c on this toolchain.
# Keeping the default DIO @ 80 MHz; the JIT win from faster flash is
# small relative to chasing that breakage.

# --- Release build: silence the log subsystem -------------------------
# Drop both the bootloader and the runtime default log level to ERROR.
# ESP_LOGI / ESP_LOGW from IDF and from our code (boot banner, OLED
# init, per-second oled_task line, serial-trap dump) all get filtered
# out at the format-call site. Genuine failures still print via
# ESP_LOGE. UART writes are blocking on Core 0 so silencing the noisy
# levels removes a real wall-clock cost. Flip back to INFO to debug.
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
